test/basic/constant/physicalProperties.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight       18.01;
    }
    thermodynamics
    {
        Cp              4.162279e+3;
        Cv              4.156645e+3;
        Tref            273.16;
        Hsref           0.611783;
        Hf              0;

        // hPoly
        CpCoeffs (4000 -0.05 0.003 0 0 0 0 0);
    }
    equationOfState
    {
        // rPolynomial
        C (0.001278 -2.1055e-06 3.9689e-09 4.3772e-13 -2.0225e-16);

        // Boussinesq
        // (hand-)fitted to rPolynomila and IAPWS
        rho0            999.2;
        T0              288.16;
        beta            0.000207;
        // Const
        rho             1000;
    }
    transport
    {
        // const
        mu              3.645e-4;
        Pr              0.289;
    }
}


// fluidProperties
// {
// 	densityModel constantDensity;
// 
// 	constantDensityCoeffs
// 	{
// 		rho0         rho0   [ 1 -3 0 0 0 0 0 ] 1000;
// 	}
// 
// 	viscosityModel constantViscosity;
// 
// 	constantViscosityCoeffs
// 	{
// 		nu0         nu0   [ 0 2 -1 0 0 0 0 ] 1e-6;
// 	}
// 
// 
// 
// }
// 
// 
// transportModel  Newtonian;
// mu             mu  [ 1 -1 -1 0 0 0 0 ] 1e-3;
// //nu 		nu [ 0 2 -1 0 0 0 0 ] 1e-6;
// 
// 
// geochemistryModel flowOnly;
// 
// geochemistryProperties
// {
// 	 mineral (Calcite);
// 
// 	 absolutePermeabilityModel heterogeneousScalarConstant;
// 	 heterogeneousScalarConstantCoeffs
// 	 {
// 		K0 K0 [0 2 0 0 0 0 0] 1e-11;
// 	//	updateFromInitialValue on;
// 	 }
// 
// 	 dispersionModel none;
// 
// 	 CalciteProperties
// 	 {
// 		activatePhaseEquilibrium false;
// 		rhos rhos [1 -3 0 0 0 0 0] 2707;
// 		Vm Vm [0 3 0 0 -1 0 0] 36.93336e-6;
// 		surfaceAreaModel none;
// 	 }
// 
// }

// ************************************************************************* //
