test/basic/constant/porousProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      porousMedia;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

absolutePermeabilityModel absolutePermeabilityConst;

absolutePermeabilityConstCoeffs
{
    K0 (
        1e-11 0     0
        0     1e-11 0
        0     0     1e-11
    );
}

geochemistryModel geochemistryNone;

geochemistryNoneCoeffs
{
    eps0 0.2;
}

/*
dispersionModel dispersionConst;

dispersionConstCoeffs
{
    D0 (
        1e-9 0    0
        0    1e-9 0
        0    0    1e-9
    );
}

surfaceAreaModel surfaceAreaConst;

surfaceAreaConstCoeffs
{
    A0 1;
}
*/
// ************************************************************************* //
